tsung/load_test_new.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="load-test-chienyu.kqsu4hptxs.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
	<!-- user flow 1 --doing nothing but hanging around-->
    <session name="user_flow_1" probability="20" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>  

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>
	  
	  <request>
        <http url='/communities' version='1.1' method='GET'></http>
      </request>
     <thinktime value="2" random="true"></thinktime>
	 
	 <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
     <thinktime value="1" random="true"></thinktime>
	 
	  <request>
        <http url='/users/password/new' version='1.1' method='GET'></http>
      </request>
     <thinktime value="1" random="true"></thinktime>
	 
	  <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>

    </session>
	
	<!-- user flow 2 --hanging around and check some crap(from ChienYu)-->
	<session name="user_flow_2" probability="30" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>  

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="nth_item" />
      </setdynvars>																					

      <request subst="true">		<!-- set to true when using random variable-->
        <http url='/bid_items/%%_nth_item%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="nth_item2" />
      </setdynvars>

      <request subst="true">
        <http url='/bid_items/%%_nth_item2%%' version='1.1' method='GET'></http>
      </request>

    </session>
	
	<!-- user flow 3 --hanging around,log in, and post some crap -->
	<session name="user_flow_3" probability="30" type="ts_http">
		
	  <request>
       <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="99">
        <var name="nth_user" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <dyn_variable name="user_id" re="[Ll]ocation: http://.*/users/(.*)\r" />
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_nth_user%%@%%_nth_user%%&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true" >
        <dyn_variable name="item_id" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url='/bid_items' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=1234" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

    </session>
	
	
	<!-- user flow 4 --do some search using search bar and click some crap-->
	<session name="user_flow_3" probability="20" type="ts_http">     
	  <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>  

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>
	  
	  <request>
        <http url='/communities' version='1.1' method='GET'></http>
      </request>
     <thinktime value="2" random="true"></thinktime>
	 
	 <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>
     <thinktime value="1" random="true"></thinktime>
	  <!-- do a search -->
	  
        <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="random_string" length="2">
          <var name="rnd_bid_name" />
       </setdynvars>
 
        <request subst = "true">
            <http url='/search/show?utf8=%E2%9C%93&amp;search=%%_rnd_bid_name%%&amp;button=' version='1.1' method='GET' ></http>
        </request> 
		
		

    </session>

  </sessions>
</tsung>